{
  "Hustle": [
    {
      "text": "David Martinez is like an algebra problem invented by America — he's polynomial, and fractioned, full of identity variables and unsolved narrative coefficients. How does it all go together? And what does it add up to? The speaker in Hustle roams the kingdoms of experience, from stealing cars to explaining post-colonialism to his Mexican grandfather, from celebrating sex to wondering about the crippling mixture of strength and weakness in the men around him. Martinez's poetic voice sings story, talks wisdom, and verbally switches between the sophistications of the academy and those of slang. Out of these trespassings and travels, he makes an original, wise, and tender poetry. Hustle is full of dashing nerve, linguistic flair, and unfakeable heart.",
      "creator": "Tony Hoagland"
    },
    {
      "text": "Welcome to the world of David Tomas Martinez, where cars want to be stolen and the faucet is held like a gun, and homemade tattoos thicken with age. He breathes fresh air into American poetry by bringing it to the street—away from the Ivory Tower, away from the self-referential jokes and commentary. Martinez allows us to see Neruda's love songs again, but this time they \"whoop / a motherfucker's ass.\" And he makes up his own vocabulary here, one in which the word \"weekend\" comes from word \"weaken,\" long estranged from \"wedded.\" Open this book on the poems like \"Sabbath Fe Minus\" or \"California Penal Code 266,\" or \"Coveralls,\" and you will see right away a tone that is restless, metaphors that thrill you, and music that is so contagious it just won't let you be. That is because David Tomas Martinez is a real poet.",
      "creator": "Ilya Kaminsky"
    },
    {
      "text": "In these intricate, psychologically rich poems, David Tomas Martinez looks back on a harrowing youth in a rough part of town, at one point concluding, \"as a boy, I died into silent manhood.\" Here, the shooting of a school acquaintance becomes an opportunity for a kaleidoscopic investigation of violence, mortality, and doomed youth. Or the ruined landscape of a concrete urban park provokes a meditation on the sadness that smolders just beneath youthful bravado. Elsewhere, the intricacies of family lore mix with the half-understood yearnings of a young man eager to make his name outside of the neighborhood. From maturity, these poems look to the past with resigned brilliance, finding in recollection not just self-knowledge, but a larger truth about the inescapable power of memory and experience to shape us. Hustle is a terrific, electric first book or poems.",
      "creator": "Kevin Prufer"
    },
    {
      "text": "If you saw this man stepping the concrete, tatted—full sleeves—snapping to his own beat, you'd know, this is the one who will write the holy book of the streets. And he has. Welcome please to the spinning wonder of David Tomas Martinez.",
      "creator": "Sandra Alcosser"
    },
    {
      "text": "David Tomas Martinez is a born storyteller with a truly rare lyric gift. In the outstanding collection Hustle, Martinez writes about rappers and fathers and daughters, the perfection of Whitman, and an iron worker named Lucy you won’t forget. Martinez takes the stuff of his experience and makes it pulse, and kick, and sting, makes it memorable, makes it (for lack of a better term) matter. Hustle establishes Martinez as a threat: a practitioner of the Poetry of Now.",
      "creator": "Dennis Mahagin (author of Grand Ma)"
    },
    {
      "text": "In his debut poetry collection, Martinez translates the unique nature of his autobiography with an acute ear for rhythm, transporting readers from barrio alleyways to the shipyards of San Diego to the halls of Houston academia, broaching such topics as young fatherhood, gang life, and stereotypical masculinity with refreshing candor and linguistic savvy. In the same breath, Martinez allows his poetic speakers to address adolescent slap boxing and Mayan athleticism, rare-book collecting and small-time drug dealing. By turns acoustically playful (“the kicking of her feet / makes the splayed sheets shake”) and profoundly honest (“childhood is a form of taxidermy”), Martinez creates a hybrid universe in which T. S. Eliot and Emily Dickinson drink malt liquor. From the tattoos of gangbanging brothers to the spiked fruit of canyon cacti, Martinez revels in the extraordinary contradictions that arise when poetry arrives stomping, chanting, and slinging urban grit against the polished facade of the ivory tower. A necessary addition to Chicano, Latino, and American poetry alongside writers Rodney Gomez, Laurie Ann Guerrero, and Rosebud Ben-Oni.",
      "creator": "Diego Báez"
    }
  ]
}
